{"offic":0,"112":1,"verdict":2,"move":3,"specialist":4,"has":5,"annual":6,"event":7,"handl":8,"298":9,"715":10,"singl":11,"privat":12,"repair":13,"208":14,"fifth":15,"reflect":16,"principl":17,"649":18,"do":19,"875":20,"stockhold":21,"458":22,"sec":23,"stage":24,"correspond":25,"347":26,"187":27,"good":28,"19":29,"addit":30,"threshold":31,"face":32,"while":33,"our":34,"sec_edgar":35,"repurchas":36,"averageamortizationperiod":37,"howev":38,"sanction":39,"138":40,"117":41,"181":42,"plus":43,"leasehold":44,"environment":45,"arrear":46,"340":47,"held":48,"comprehens":49,"health":50,"282":51,"taxabl":52,"worldwid":53,"exit":54,"state":55,"below":56,"local":57,"evalu":58,"336":59,"375":60,"remedi":61,"instanc":62,"new":63,"venu":64,"compli":65,"transfer":66,"299":67,"238":68,"248":69,"yes":70,"109":71,"61":72,"415":73,"after":74,"money":75,"vestcom":76,"put":77,"switzerland":78,"attribut":79,"213":80,"845":81,"commenc":82,"210":83,"631":84,"against":85,"gave":86,"leader":87,"obsolet":88,"possibl":89,"interest":90,"strategi":91,"grant":92,"expand":93,"both":94,"margin":95,"18":96,"medicar":97,"565":98,"592":99,"manner":100,"171":101,"288":102,"maximum":103,"macroeconom":104,"audit":105,"host":106,"organ":107,"nonexclus":108,"83":109,"accrual":110,"247":111,"173":112,"migrat":113,"76":114,"settlement":115,"74":116,"repay":117,"exclus":118,"24":119,"should":120,"divid":121,"becom":122,"tax":123,"uncertain":124,"2030":125,"qualifi":126,"intang":127,"cloud":128,"declin":129,"avail":130,"labor":131,"scope":132,"term":133,"gain":134,"track":135,"circumst":136,"array":137,"name":138,"165":139,"loss":140,"posit":141,"www":142,"how":143,"rsus":144,"0000008818":145,"arrang":146,"retir":147,"commerci":148,"59":149,"2026":150,"label":151,"500":152,"bank":153,"restructur":154,"209":155,"77":156,"greater":157,"domest":158,"carlo":159,"semiannu":160,"solut":161,"document":162,"453":163,"analyz":164,"cours":165,"met":166,"174":167,"real":168,"minim":169,"progress":170,"agre":171,"163":172,"ratabl":173,"regular":174,"126":175,"consider":176,"11":177,"refinanc":178,"can":179,"976":180,"neither":181,"eventu":182,"retent":183,"calendar":184,"130":185,"request":186,"proceed":187,"86":188,"659":189,"676":190,"shorter":191,"data":192,"308":193,"228":194,"suprem":195,"capit":196,"ani":197,"170":198,"43":199,"400":200,"two":201,"145":202,"maintain":203,"suffici":204,"judgment":205,"meet":206,"negoti":207,"various":208,"89":209,"306":210,"project":211,"disaggreg":212,"commiss":213,"120":214,"canadian":215,"137":216,"fund":217,"12":218,"start":219,"provid":220,"470":221,"resourc":222,"had":223,"model":224,"ticaret":225,"saturday":226,"326":227,"2020":228,"sirketi":229,"25":230,"relat":231,"compon":232,"either":233,"consist":234,"pre":235,"780":236,"277":237,"customari":238,"dure":239,"cliff":240,"seller":241,"152":242,"outweigh":243,"advanc":244,"147":245,"litig":246,"50":247,"indic":248,"activ":249,"north":250,"acquisit":251,"complet":252,"provis":253,"certain":254,"one":255,"approxim":256,"328":257,"summari":258,"codm":259,"fact":260,"art":261,"disclos":262,"550":263,"upgrad":264,"cashpay":265,"721":266,"whether":267,"dennison":268,"juli":269,"digit":270,"kong":271,"patent":272,"concess":273,"275":274,"activemarket":275,"2017":276,"march":277,"cash":278,"full":279,"dividend":280,"grosscarryingamount":281,"epa":282,"dispos":283,"2009":284,"48":285,"carryforward":286,"purpos":287,"laundri":288,"reconcili":289,"district":290,"class":291,"160":292,"account":293,"collar":294,"545":295,"save":296,"indebted":297,"valid":298,"953":299,"code":300,"0025":301,"return":302,"govern":303,"199":304,"503":305,"cafc":306,"undiscount":307,"treasurystock":308,"avy_10k_feb2025_subset":309,"ration":310,"maryland":311,"expenditur":312,"395":313,"33":314,"conting":315,"chain":316,"115":317,"088":318,"date":319,"zero":320,"resolv":321,"tekstil":322,"tangibl":323,"effici":324,"end":325,"entir":326,"outsid":327,"home":328,"loan":329,"127":330,"weightedaveragegr":331,"europ":332,"330":333,"820":334,"equip":335,"unrecogn":336,"169":337,"market":338,"reduc":339,"enter":340,"instal":341,"27":342,"239":343,"valu":344,"futur":345,"450":346,"sheet":347,"256":348,"reissuanc":349,"train":350,"physic":351,"885":352,"limit":353,"period":354,"charg":355,"196":356,"platform":357,"thermopatch":358,"70":359,"trial":360,"reward":361,"readili":362,"them":363,"incorpor":364,"statut":365,"unamort":366,"titl":367,"film":368,"precis":369,"2028":370,"knit":371,"licens":372,"114":373,"reclassifi":374,"impair":375,"578":376,"liabil":377,"pay":378,"630":379,"order":380,"take":381,"examin":382,"sponsor":383,"leas":384,"call":385,"212":386,"print":387,"life":388,"100":389,"year":390,"ir":391,"where":392,"699":393,"245":394,"958":395,"315":396,"wast":397,"md":398,"000000881825000003":399,"mutual":400,"form":401,"techniqu":402,"cashimpair":403,"automot":404,"ratio":405,"file":406,"021":407,"reissu":408,"believ":409,"continu":410,"290":411,"requir":412,"694":413,"swap":414,"invoic":415,"enhanc":416,"over":417,"2010":418,"37":419,"539":420,"32":421,"space":422,"contract":423,"cleanup":424,"consequ":425,"22":426,"221":427,"silver":428,"420":429,"yet":430,"sever":431,"635":432,"execut":433,"defer":434,"327":435,"estat":436,"543":437,"cumul":438,"891":439,"978":440,"absolut":441,"36":442,"decad":443,"inactivemarket":444,"statutori":445,"condit":446,"adopt":447,"unsatisfi":448,"insert":449,"intrins":450,"insur":451,"606":452,"97":453,"961":454,"iii":455,"recaptur":456,"ii":457,"formula":458,"exchang":459,"committe":460,"foreign":461,"prospect":462,"recycl":463,"280":464,"ofrsus":465,"connect":466,"could":467,"96":468,"when":469,"lg":470,"742":471,"ongo":472,"person":473,"628":474,"align":475,"225":476,"trust":477,"693":478,"57":479,"521":480,"consult":481,"partial":482,"259":483,"work":484,"725":485,"better":486,"claim":487,"292":488,"unvest":489,"specifi":490,"caus":491,"bond":492,"224":493,"back":494,"type":495,"research":496,"correl":497,"reassess":498,"hardwar":499,"depreci":500,"variat":501,"231":502,"91":503,"897":504,"payment":505,"may":506,"sensit":507,"pretax":508,"carri":509,"atdecemb":510,"middl":511,"revolv":512,"134":513,"unfavor":514,"nonleas":515,"67":516,"269":517,"40":518,"slow":519,"552":520,"metric":521,"071":522,"generat":523,"requisit":524,"2032":525,"000003":526,"unus":527,"flowhedg":528,"459":529,"pus":530,"162":531,"466":532,"2029":533,"signific":534,"34":535,"234":536,"altern":537,"previous":538,"it":539,"factor":540,"175":541,"404":542,"experi":543,"administr":544,"605":545,"oversight":546,"own":547,"footprint":548,"31":549,"reconcil":550,"instrument":551,"rise":552,"accord":553,"474":554,"observ":555,"whenev":556,"hold":557,"implement":558,"rebat":559,"elig":560,"percentag":561,"revalu":562,"present":563,"gaap":564,"graphic":565,"iv":566,"ofrevers":567,"paper":568,"individu":569,"entiti":570,"repaid":571,"file_path":572,"intern":573,"htm":574,"beyond":575,"jurisdict":576,"discount":577,"sixth":578,"332":579,"hundr":580,"disclosur":581,"manag":582,"418":583,"10":584,"sinc":585,"gov":586,"compar":587,"recent":588,"recogn":589,"garment":590,"anoth":591,"address":592,"payabl":593,"47":594,"numer":595,"553":596,"382":597,"301":598,"general":599,"41":600,"inflat":601,"resolut":602,"prps":603,"deriv":604,"option":605,"object":606,"seri":607,"conform":608,"note":609,"offset":610,"extern":611,"00":612,"updat":613,"appli":614,"amort":615,"occur":616,"machineri":617,"protect":618,"softwar":619,"679":620,"091":621,"status":622,"401":623,"999":624,"princip":625,"care":626,"averageexercis":627,"regul":628,"modifi":629,"exposur":630,"retain":631,"structur":632,"count":633,"level":634,"incept":635,"79":636,"immateri":637,"juri":638,"fulli":639,"129":640,"assign":641,"actual":642,"vari":643,"184":644,"fourth":645,"unaffili":646,"satisfact":647,"secur":648,"06":649,"subsequ":650,"vacat":651,"113":652,"sell":653,"acquir":654,"elect":655,"613":656,"systemat":657,"woven":658,"argentina":659,"asset":660,"exclud":661,"reclassif":662,"84":663,"raw":664,"par":665,"termin":666,"measur":667,"434":668,"548":669,"probabl":670,"british":671,"fdii":672,"schole":673,"natur":674,"exceed":675,"15":676,"profit":677,"compani":678,"we":679,"lawsuit":680,"cover":681,"346":682,"fair":683,"reduct":684,"voluntarili":685,"2022":686,"disabl":687,"039":688,"unrel":689,"line":690,"683":691,"use":692,"foregon":693,"incentiv":694,"176":695,"statement":696,"andotherpostretirementbenefit":697,"inform":698,"award":699,"inventori":700,"around":701,"167":702,"commit":703,"fee":704,"456":705,"intercompani":706,"million":707,"author":708,"800":709,"94":710,"director":711,"perfect":712,"significantotherunobservableinput":713,"content":714,"contribut":715,"establish":716,"per":717,"growth":718,"314":719,"common":720,"among":721,"day":722,"attorney":723,"header_path":724,"2019":725,"multipl":726,"groundwat":727,"851":728,"586":729,"ag":730,"dilut":731,"148":732,"364":733,"blue":734,"test":735,"necessari":736,"plant":737,"tape":738,"inc":739,"primari":740,"prepar":741,"600":742,"purchas":743,"111":744,"paid":745,"gross":746,"575":747,"like":748,"asia":749,"higher":750,"adasa":751,"ineffect":752,"quotedpricesin":753,"earn":754,"922":755,"separ":756,"310":757,"net":758,"pu":759,"202":760,"250":761,"cross":762,"lower":763,"013":764,"less":765,"each":766,"217":767,"82":768,"similar":769,"regard":770,"416":771,"811":772,"adequ":773,"receiv":774,"vote":775,"crystal":776,"576":777,"360":778,"match":779,"product":780,"uniqu":781,"about":782,"55":783,"124":784,"engag":785,"29":786,"low":787,"expect":788,"categori":789,"her":790,"408":791,"2034":792,"restrict":793,"analysi":794,"527":795,"370":796,"februari":797,"indirect":798,"deduct":799,"process":800,"265":801,"64":802,"possess":803,"72":804,"perpetu":805,"all":806,"routin":807,"becaus":808,"pharmaceut":809,"255":810,"function":811,"also":812,"foreigncurrencytransl":813,"disposit":814,"intend":815,"live":816,"fasb":817,"149":818,"nomin":819,"214":820,"locat":821,"groceri":822,"world":823,"243":824,"region":825,"involv":826,"alloc":827,"pension":828,"edgar":829,"qualiti":830,"primarili":831,"realiz":832,"instruct":833,"curv":834,"withhold":835,"880":836,"deliveri":837,"his":838,"revis":839,"tier":840,"draft":841,"commod":842,"segment":843,"ownership":844,"group":845,"076":846,"ultim":847,"further":848,"cannot":849,"211":850,"879":851,"most":852,"unreal":853,"minimum":854,"suppli":855,"390":856,"so":857,"reserv":858,"credit":859,"materi":860,"remand":861,"gilti":862,"1par":863,"2023":864,"ventur":865,"35":866,"flow":867,"multipli":868,"achiev":869,"plan":870,"750":871,"663":872,"755":873,"pursuant":874,"substant":875,"65":876,"180":877,"averi":878,"75":879,"datefair":880,"retainedearn":881,"87":882,"tranch":883,"approach":884,"specif":885,"312":886,"age":887,"concern":888,"fix":889,"04":890,"01":891,"polici":892,"exercis":893,"relev":894,"earli":895,"everi":896,"thereaft":897,"except":898,"expens":899,"chip":900,"affirm":901,"274":902,"consid":903,"pool":904,"78":905,"862":906,"high":907,"second":908,"global":909,"489":910,"377":911,"forfeitur":912,"equival":913,"obvious":914,"mid":915,"netherland":916,"out":917,"forese":918,"prior":919,"frequenc":920,"opinion":921,"major":922,"appeal":923,"goodwil":924,"45":925,"upon":926,"https":927,"brand":928,"contamin":929,"608":930,"uncertainti":931,"28":932,"17":933,"68":934,"make":935,"collect":936,"nav":937,"due":938,"did":939,"642":940,"650":941,"quotedpric":942,"104":943,"73":944,"227":945,"stock":946,"oregon":947,"subsidiari":948,"within":949,"wide":950,"92":951,"351":952,"short":953,"thereund":954,"086":955,"599":956,"reason":957,"black":958,"hand":959,"610":960,"contain":961,"pensionbenefit":962,"three":963,"simul":964,"latin":965,"appropri":966,"260":967,"687":968,"317":969,"200":970,"varieti":971,"20241228":972,"strike":973,"those":974,"incent":975,"repatri":976,"heavili":977,"outstand":978,"decemb":979,"summar":980,"africa":981,"expedi":982,"prp":983,"without":984,"commerc":985,"close":986,"geograph":987,"associ":988,"financi":989,"048":990,"dollar":991,"equal":992,"estimatedamortizationexpens":993,"involuntari":994,"right":995,"23":996,"sharehold":997,"were":998,"tag":999,"imput":1000,"result":1001,"practic":1002,"minus":1003,"bear":1004,"finit":1005,"155":1006,"2027":1007,"rfid":1008,"applic":1009,"177":1010,"826":1011,"cancel":1012,"facil":1013,"divest":1014,"757":1015,"leverag":1016,"2033":1017,"estateinvest":1018,"holiday":1019,"quantit":1020,"495":1021,"sport":1022,"court":1023,"fiscal":1024,"hong":1025,"includ":1026,"477":1027,"non":1028,"hierarchi":1029,"straight":1030,"until":1031,"ofmsus":1032,"set":1033,"203":1034,"119":1035,"littl":1036,"began":1037,"rate":1038,"have":1039,"recover":1040,"supplement":1041,"266":1042,"time":1043,"spread":1044,"44":1045,"53":1046,"544":1047,"366":1048,"389":1049,"551":1050,"incom":1051,"packag":1052,"305":1053,"indefinit":1054,"repres":1055,"implicit":1056,"firm":1057,"664":1058,"153":1059,"ten":1060,"from":1061,"finish":1062,"be":1063,"prefer":1064,"outcom":1065,"8818":1066,"pair":1067,"obtain":1068,"forward":1069,"compos":1070,"respons":1071,"matter":1072,"first":1073,"financ":1074,"priorit":1075,"665":1076,"valuat":1077,"york":1078,"rietveld":1079,"divis":1080,"item":1081,"impact":1082,"rather":1083,"see":1084,"796":1085,"comput":1086,"frozen":1087,"90":1088,"identifi":1089,"workwear":1090,"postretir":1091,"shown":1092,"june":1093,"penalti":1094,"revers":1095,"892":1096,"subset":1097,"been":1098,"62":1099,"ticket":1100,"averag":1101,"inquiri":1102,"given":1103,"242":1104,"13":1105,"direct":1106,"temporari":1107,"argentin":1108,"615":1109,"radio":1110,"translat":1111,"624":1112,"increas":1113,"depend":1114,"four":1115,"netcarryingamount":1116,"ship":1117,"656":1118,"payrol":1119,"135":1120,"197":1121,"traceabl":1122,"741":1123,"297":1124,"allow":1125,"481":1126,"mix":1127,"improv":1128,"week":1129,"766":1130,"anticip":1131,"sold":1132,"post":1133,"300":1134,"39":1135,"effect":1136,"forfeit":1137,"007":1138,"share":1139,"relationship":1140,"team":1141,"sterl":1142,"royalti":1143,"longer":1144,"rang":1145,"69":1146,"month":1147,"gas":1148,"writ":1149,"154":1150,"107":1151,"incur":1152,"parti":1153,"quot":1154,"excess":1155,"formal":1156,"399":1157,"763":1158,"unit":1159,"marketplac":1160,"brother":1161,"46":1162,"aris":1163,"downward":1164,"ve":1165,"191":1166,"remain":1167,"methodolog":1168,"thing":1169,"medic":1170,"unobserv":1171,"remeasur":1172,"386":1173,"next":1174,"transit":1175,"certif":1176,"329":1177,"board":1178,"design":1179,"reconsid":1180,"2021":1181,"categor":1182,"2044":1183,"157":1184,"consolid":1185,"022":1186,"feder":1187,"cost":1188,"public":1189,"variabl":1190,"refer":1191,"95":1192,"benefit":1193,"substanti":1194,"determin":1195,"unfund":1196,"229":1197,"2024":1198,"394":1199,"liquid":1200,"octob":1201,"perform":1202,"inlay":1203,"which":1204,"screenprint":1205,"232":1206,"econom":1207,"significantotherobservableinput":1208,"death":1209,"396":1210,"622":1211,"803":1212,"optim":1213,"shipment":1214,"fairvalu":1215,"agreement":1216,"867":1217,"uncollect":1218,"stipul":1219,"696":1220,"expir":1221,"unsecur":1222,"through":1223,"85":1224,"differ":1225,"motion":1226,"orient":1227,"onli":1228,"closest":1229,"924":1230,"mirror":1231,"employ":1232,"employe":1233,"854":1234,"amend":1235,"best":1236,"properti":1237,"guidanc":1238,"118":1239,"prejudg":1240,"accru":1241,"offer":1242,"538":1243,"559":1244,"840":1245,"extent":1246,"54":1247,"corpor":1248,"16":1249,"99":1250,"serigrafi":1251,"between":1252,"nontransfer":1253,"accumulatedamort":1254,"us":1255,"senior":1256,"mainten":1257,"site":1258,"april":1259,"inexcessofpar":1260,"usag":1261,"849":1262,"032":1263,"increment":1264,"weight":1265,"515":1266,"industri":1267,"defin":1268,"restat":1269,"legaci":1270,"530":1271,"denomin":1272,"certiorari":1273,"38":1274,"book":1275,"oblig":1276,"identif":1277,"estim":1278,"yield":1279,"made":1280,"china":1281,"789":1282,"custom":1283,"circuit":1284,"basi":1285,"petit":1286,"63":1287,"issu":1288,"interim":1289,"food":1290,"amount":1291,"stream":1292,"transpar":1293,"equiti":1294,"dsus":1295,"regulatori":1296,"late":1297,"938":1298,"third":1299,"exist":1300,"ithalat":1301,"invest":1302,"averagegr":1303,"reli":1304,"admiss":1305,"unrestrict":1306,"93":1307,"durat":1308,"30":1309,"156":1310,"access":1311,"onto":1312,"msus":1313,"106":1314,"program":1315,"261":1316,"190":1317,"revenu":1318,"reimburs":1319,"target":1320,"august":1321,"trade":1322,"presid":1323,"length":1324,"recognit":1325,"81":1326,"key":1327,"issuanc":1328,"transact":1329,"nor":1330,"chines":1331,"subject":1332,"49":1333,"383":1334,"archiv":1335,"servic":1336,"quarter":1337,"438":1338,"deni":1339,"treatment":1340,"lti":1341,"surrend":1342,"classifi":1343,"novemb":1344,"313":1345,"507":1346,"agenc":1347,"sewn":1348,"26":1349,"retire":1350,"releas":1351,"peso":1352,"mont":1353,"baski":1354,"289":1355,"law":1356,"preliminari":1357,"decid":1358,"accept":1359,"aggregateintrins":1360,"52":1361,"european":1362,"198":1363,"interseg":1364,"passiv":1365,"hospit":1366,"show":1367,"risk":1368,"adjust":1369,"favor":1370,"rule":1371,"151":1372,"379":1373,"192":1374,"compens":1375,"begin":1376,"58":1377,"logist":1378,"warehous":1379,"januari":1380,"sustain":1381,"underwrit":1382,"base":1383,"volatil":1384,"busi":1385,"particip":1386,"textrac":1387,"388":1388,"662":1389,"scienc":1390,"grade":1391,"convert":1392,"currenc":1393,"bid":1394,"portfolio":1395,"input":1396,"tabl":1397,"223":1398,"same":1399,"704":1400,"oper":1401,"billion":1402,"assum":1403,"matur":1404,"spot":1405,"51":1406,"abov":1407,"satisfi":1408,"vest":1409,"000":1410,"other":1411,"fulfil":1412,"1995":1413,"381":1414,"lender":1415,"current":1416,"under":1417,"embellish":1418,"togeth":1419,"price":1420,"final":1421,"809":1422,"relief":1423,"60":1424,"618":1425,"histor":1426,"legal":1427,"2025":1428,"625":1429,"larg":1430,"assumpt":1431,"maker":1432,"advers":1433,"discontinu":1434,"retail":1435,"deposit":1436,"88":1437,"impli":1438,"ad":1439,"america":1440,"thousand":1441,"respect":1442,"817":1443,"record":1444,"80":1445,"adhes":1446,"assur":1447,"largest":1448,"befor":1449,"upward":1450,"technolog":1451,"east":1452,"renminbi":1453,"follow":1454,"capabl":1455,"sanayi":1456,"252":1457,"popul":1458,"coincid":1459,"aggreg":1460,"pound":1461,"041":1462,"advantag":1463,"serv":1464,"debt":1465,"manufactur":1466,"582":1467,"overal":1468,"calcul":1469,"well":1470,"matbaa":1471,"195":1472,"110":1473,"would":1474,"278":1475,"indemn":1476,"free":1477,"142":1478,"144":1479,"balanc":1480,"infring":1481,"permit":1482,"ihracat":1483,"elimin":1484,"fraction":1485,"pressur":1486,"more":1487,"than":1488,"71":1489,"reliev":1490,"fluctuat":1491,"build":1492,"forth":1493,"help":1494,"enabl":1495,"produc":1496,"66":1497,"combin":1498,"hedg":1499,"notion":1500,"method":1501,"sublicens":1502,"display":1503,"814":1504,"soil":1505,"five":1506,"number":1507,"canada":1508,"168":1509,"retrial":1510,"recur":1511,"414":1512,"case":1513,"damag":1514,"916":1515,"area":1516,"extend":1517,"497":1518,"expiri":1519,"long":1520,"potenti":1521,"chang":1522,"averageremainingcontractu":1523,"medium":1524,"141":1525,"585":1526,"special":1527,"140":1528,"204":1529,"near":1530,"up":1531,"02":1532,"20":1533,"215":1534,"countri":1535,"what":1536,"assess":1537,"transport":1538,"newli":1539,"avi":1540,"actuari":1541,"possibletm":1542,"496":1543,"decreas":1544,"borrow":1545,"control":1546,"belgium":1547,"treasuri":1548,"portion":1549,"56":1550,"review":1551,"commonstock":1552,"government":1553,"report":1554,"circular":1555,"trademark":1556,"develop":1557,"trend":1558,"accumul":1559,"some":1560,"14":1561,"underperform":1562,"078":1563,"caption":1564,"consum":1565,"renew":1566,"qualit":1567,"920":1568,"negat":1569,"part":1570,"complianc":1571,"util":1572,"apparel":1573,"euro":1574,"alleg":1575,"inflationari":1576,"across":1577,"forecast":1578,"inclus":1579,"lion":1580,"evid":1581,"chief":1582,"21":1583,"guarante":1584,"eugen":1585,"approv":1586,"323":1587,"affect":1588,"691":1589,"action":1590,"issuabl":1591,"sale":1592,"decis":1593,"total":1594,"visibl":1595,"42":1596,"investig":1597,"describ":1598,"accumulatedothercomprehensiveloss":1599,"fasten":1600,"coven":1601,"661":1602,"":1603}